Autodesk.Aec.PropertyData.ScheduleHeaderPositionNode
Represents a Schedule Header Position Node.

Autodesk.Aec.PropertyData.ScheduleHeaderPositionNode.#ctor(System.String,Autodesk.Aec.PropertyData.ScheduleTableHeaderPosition,Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleHeaderNode)
Initializes a new instance of the ScheduleHeaderPositionNode class using the specified header, position and header node.
header: Header.
position: Position.
headerNode: Header Node.

Autodesk.Aec.PropertyData.ScheduleHeaderPositionNode.Heading
Gets the heading.

Autodesk.Aec.PropertyData.ScheduleHeaderPositionNode.Position
Gets the position.

Autodesk.Aec.PropertyData.ScheduleHeaderPositionNode.HeaderNode
Gets the header node.