Autodesk.Aec.PropertyData.ScheduleTableHeaderPosition
Represents a Schedule Table Header Position.

Autodesk.Aec.PropertyData.ScheduleTableHeaderPosition.#ctor
Initializes a new instance of the ScheduleTableHeaderPosition class.

Autodesk.Aec.PropertyData.ScheduleTableHeaderPosition.#ctor(System.Double,System.Double,System.Double,System.Double)
Initializes a new instance of the ScheduleTableHeaderPosition class.
left: Left.
right: Right.
bottom: Bottom.
top: Top.

Autodesk.Aec.PropertyData.ScheduleTableHeaderPosition.Left
Gets or sets left.

Autodesk.Aec.PropertyData.ScheduleTableHeaderPosition.Right
Gets or sets right.

Autodesk.Aec.PropertyData.ScheduleTableHeaderPosition.Bottom
Gets or sets bottom.

Autodesk.Aec.PropertyData.ScheduleTableHeaderPosition.Top
Gets or sets top.