Autodesk.Aec.PropertyData.ScheduleTableHeaderPositionIterator.Create(System.IntPtr,System.Boolean)
Initializes a new instance of the ScheduleTableHeaderPosition class.

Autodesk.Aec.PropertyData.ScheduleTableHeaderPositionIterator
Represents a Schedule Table Header Position Iterator.

Autodesk.Aec.PropertyData.ScheduleTableHeaderPositionIterator.Next
Next ScheduleHeaderPositionNode.
Returns: The next scheduleHeaderPositionNode.

Autodesk.Aec.PropertyData.ScheduleTableHeaderPositionIterator.Reset
Reset the iterator.