Autodesk.Aec.PropertyData.DatabaseServices.PropertyValueUnitPair
Represents a value-unit pair for a given property.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyValueUnitPair.UnitType
Gets the unit type.
Returns: The unit type.
Remarks: Applies only to those properties that return a real number.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyValueUnitPair.Value
Gets the value.
Returns: The value.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyValueUnitPair.DeleteUnmanagedObject
Disposes the unit type.