Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinitionGraphic
Represents a graphic property definition.
Remarks: Graphic property values can be blocks in the current drawing or image files, such as BMP, GIF, JPG, PNG, or TIF.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinitionGraphic.#ctor
Initializes a new instance of the PropertyDefinitionGraphic class.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinitionGraphic.GraphicType
Gets or sets the graphic type.
Returns: Returns the graphic type.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinitionGraphic.BlockName
Gets or sets the block name.
Returns: Returns the block name.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinitionGraphic.BlockId
Gets or sets the object id of the block to which it references.
Returns: Returns the object id of the block to which it references.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinitionGraphic.ImageFileName
Gets or sets the image file name.
Returns: Returns the image name.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinitionGraphic.ImageFileNameStripped
Gets the stripped image file name.
Returns: Returns the stripped image name.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinitionGraphic.SetImageFileName(System.String,System.String)
Sets the image name.
fileName: The image name.
fileNameStripped: The stripped image name.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinitionGraphic.LayerKey
Gets or sets the layer key.
Returns: Returns the layer key.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinitionGraphic.Rotation
Gets or sets the rotation.
Returns: Returns the rotation.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinitionGraphic.UsePropertyDefinitionNamesForDescription
Gets or sets whether the property definition names, to which it references, should be used for description.
Returns: Returns whether the property definition names, to which it references, should be used for description.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinitionGraphic.SupportedImageTypes
Gets the supported image types.
Returns: Returns the supported image types.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinitionGraphic.GetDisplayString(Autodesk.Aec.PropertyData.DatabaseServices.GraphicType)
Gets the display string of the specified graphic type.
type: The specified graphic type.