Autodesk.Aec.PropertyData.DatabaseServices.PropertySetData
Represents property set data.

Autodesk.Aec.PropertyData.DatabaseServices.PropertySetData.#ctor
Initializes a new instance of the PropertySetData class.

Autodesk.Aec.PropertyData.DatabaseServices.PropertySetData.CopyFrom(Autodesk.AutoCAD.Runtime.RXObject)
Copies property set data from the specified property set data object.
other: The other property set data object.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.PropertySetData.Id
Gets or sets the property Id.
Returns: Returns the property Id.

Autodesk.Aec.PropertyData.DatabaseServices.PropertySetData.DataType
Gets or sets the property data type.
Returns: Returns the property data type.

Autodesk.Aec.PropertyData.DatabaseServices.PropertySetData.GetData
Gets the property data.
Returns: Returns the property data, or null if not found.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.PropertySetData.GetData(Autodesk.Aec.DatabaseServices.UnitType)
Gets the property data.
unitType: The unit type.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.PropertySetData.SetData(System.Object)
Sets the property data.
data: The property data.
Throws System.ArgumentException: System.ArgumentException.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.PropertySetData.SetData(System.Object,Autodesk.Aec.DatabaseServices.UnitType)
Sets the property data.
data: The property data.
unitType: The unit type.
Throws System.ArgumentException: System.ArgumentException.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.PropertySetData.IsUnspecified
Gets or sets the value that indicates if the property is unspecified.
Returns: Returns the value that indicates if the property is unspecified.

Autodesk.Aec.PropertyData.DatabaseServices.PropertySetData.ContainsFields
Get the value that indicates if the property contains fields.
Returns: Returns the value that indicates if the property contains fields.

Autodesk.Aec.PropertyData.DatabaseServices.PropertySetData.ClearFieldData
Clears the field data for the property.

Autodesk.Aec.PropertyData.DatabaseServices.PropertySetData.GetFieldGeneratedData(System.Boolean)
Gets the field generated data for the property.
asFieldCode: Determines if the value returned is a field code or text.
Returns: Returns the field generated data for the property.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.PropertySetData.FieldBucketId
Gets the field code Id.
Returns: Returns the field code Id.

Autodesk.Aec.PropertyData.DatabaseServices.PropertySetData.UnitType
Gets or sets the property unit type.
Returns: Returns the property unit type.

Autodesk.Aec.PropertyData.DatabaseServices.PropertySetData.GetFieldId(System.Object,Autodesk.Aec.DatabaseServices.UnitType)
Get the field id.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.