Autodesk.Aec.PropertyData.DatabaseServices.AnchorTagToEntity
Represents a AnchorTagToEntity.

Autodesk.Aec.PropertyData.DatabaseServices.AnchorTagToEntity.#ctor
Initializes a new instance of the AnchorTagToEntity class.

Autodesk.Aec.PropertyData.DatabaseServices.AnchorTagToEntity.EntityId
Gets or sets the entity id.

Autodesk.Aec.PropertyData.DatabaseServices.AnchorTagToEntity.SetOverride(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
Sets override.
entityId: The entity id.
blockReferencePath: The block reference path.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.