Autodesk.Aec.PropertyData.DatabaseServices.MatrixSymbolType
Defines identifiers that indicate the matrix symbol type.

Autodesk.Aec.PropertyData.DatabaseServices.MatrixSymbolType.Check
Check.

Autodesk.Aec.PropertyData.DatabaseServices.MatrixSymbolType.Dot
Dot.

Autodesk.Aec.PropertyData.DatabaseServices.MatrixSymbolType.Cross
Cross.

Autodesk.Aec.PropertyData.DatabaseServices.MatrixSymbolType.Slash
Slash.