Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyle
Represents a Schedule Table Style.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyle.#ctor
Initializes a new instance of the ScheduleTableStyle class.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyle.Title
Gets or sets the title.
Returns: The title.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyle.AppliesToFilter
Gets the entity filter.
Returns: The entity filter.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyle.EntityFilter
Sets the entity filter.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyle.Tree
Gets the tree.
Returns: The tree.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyle.Columns
Get the columns.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyle.Sortings
Get the sortings.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyle.RemapFormulaColumnIds(Autodesk.Aec.PropertyData.DatabaseServices.PropertySetDefinition,Autodesk.Aec.PropertyData.DatabaseServices.PropertySetDefinition,Autodesk.AutoCAD.Geometry.IntegerCollection,Autodesk.AutoCAD.Geometry.IntegerCollection,Autodesk.AutoCAD.Geometry.IntegerCollection)
Remap formulat column ids.
propertySetDefinition1: The first property set definition.
propertySetDefinition2: The second property set definition.
definition1PropertyIds: The first definition property id collection.
definition2PropertyIds: The second definition property id collection.
actions: The actions.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyle.FormatColumnVariant(System.Object,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Format column variant.
data: The variant data.
formatId: The format id.
Returns: The formated column variant.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyle.FormatColumnVariant(System.Object,Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Int32)
Format column variant.
data: The variant data.
formatId: The format id.
column: The column.
Returns: The formated column variant.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyle.AppliesToAll
Gets or sets applies to all.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyle.ClassificationFilter
Gets the classification filter.
Returns: The classification filter.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyle.AddClassification(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Add classification.
classificationId: The classificationId.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyle.RemoveClassification(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Remove classification.
classificationId: The classificationId.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyle.DefaultCellFormat
Default cell format.
Returns: The default cell format.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyle.ColumnHeaderFormat
Column header format.
Returns: The column header format.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyle.MatrixHeaderFormat
Matrix header format.
Returns: The matrix header format.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyle.GroupHeaderFormat
Group header format.
Returns: The group header format.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyle.TotalHeaderFormat
Total header format.
Returns: The total header format.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyle.GetColumnFormat(System.Int32)
Gets the column format.
column: The column.
Returns: The column format.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyle.TitleFormat
Gets the title format.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyle.SwapSortings(System.Int32,System.Int32)
Swap sorting.
index1: The first index.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyle.QuantityColumnHeading
Gets the quantity heading.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyle.HasQuantityColumn
Has quantity column.
Returns: True if has quantity column, false otherwise.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyle.HasFormulaColumn
Has formula column.
Returns: True if it has formula column, false otherwise.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyle.QuantityColumnNumber
Gets quantity column number.
Returns: The quantity column number.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyle.AddQuantityColumn(Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleColumn)
Add quantity column.
column: The column.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyle.AddFormulaColumn(Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleColumn)
Add formula column.
column: The column.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyle.IsQuantityColumn(Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleColumn)
Is quantity column.
column: The column.
Returns: True if it is quantity column, false otherwise.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyle.IsFormulaColumn(Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleColumn)
Is formula column.
column: The column.
Returns: True if it is formula column, false otherwise.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyle.FormulaColumnTotalNumber
Gets the formula column total number.
Returns: The formula column total number.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyle.NextFormulaId
Gets next formula id.
Returns: The formula id.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyle.RepeatFirstColumn
Gets or sets the repeat first column.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyle.SetValidityFlags
Sets the validity flags.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.