Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableCellFormatOverride
Represents a schedule table cell format override.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableCellFormatOverride.#ctor
Initializes a new instance of the ScheduleTableCellFormatOverride class.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableCellFormatOverride.HasOverrides
Gets if it has overrides.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableCellFormatOverride.OverrideTextStyleId
Gets if it override text style id.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableCellFormatOverride.ClearTextStyleIdOverride
Clear text style id override.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableCellFormatOverride.OverrideAlignment
Gets override alignment.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableCellFormatOverride.ClearAlignmentOverride
Clear alignment override.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableCellFormatOverride.OverrideWidth
Gets the override width.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableCellFormatOverride.ClearWidthOverride
Clear width override.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableCellFormatOverride.OverrideHeight
Gets override height.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableCellFormatOverride.ClearHeightOverride
Clear height override.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableCellFormatOverride.OverrideGap
Gets override gap.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableCellFormatOverride.ClearGapOverride
Clear gap override.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableCellFormatOverride.OverrideRotationType
Override rotation type.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableCellFormatOverride.ClearRotationTypeOverride
Clear rotation type override.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableCellFormatOverride.OverrideMatrixSymbolType
Gets the override matrix symbol type.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableCellFormatOverride.ClearMatrixSymbolTypeOverride
Clear matrix symbol type override.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableCellFormatOverride.OverrideUseMatrixForTrueFalse
Gets the override use matrix for true false.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableCellFormatOverride.ClearUseMatrixForTrueFalseOverride
Clear use matrix for true false override.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableCellFormatOverride.DefaultCellFormat
Gets or sets the default cell format.