Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTablePageMaxHeightCollection
Represents a collection of Schedule Table Page Max Height.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTablePageMaxHeightCollection.GetEnumerator
Returns an enumerator for this collection.
Returns: Returns an enumerator for this collection.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTablePageMaxHeightCollection.Count
Returns the number of System::Double available in this collection.
Returns: Returns the number of System::Double available in this collection.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTablePageMaxHeightCollection.CopyTo(System.Double[],System.Int32)
Copies the collection to the array.
array: The System::Double array.
start: The start index to begin copying.
Throws System.ArgumentNullException: System.ArgumentNullException.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.
Throws System.ArgumentException: System.ArgumentException.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTablePageMaxHeightCollection.Item(System.Int32)
Gets or sets the item at the given index.
index: The index.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTablePageMaxHeightCollection.Add(System.Double)
Adds an item to the collection.
value: The item.
Returns: Returns the index where the item was added.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTablePageMaxHeightCollection.Contains(System.Double)
Determines if the collection contains the specified item.
value: The item.
Returns: Returns true if the collection contains the specified item.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTablePageMaxHeightCollection.IndexOf(System.Double)
Determines the index of the specified item.
value: The item.
Returns: Returns the index of the specified item.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTablePageMaxHeightCollection.Insert(System.Int32,System.Double)
Inserts the specified item into the collection at the specified index.
index: The index to insert the item at.
value: The item to insert.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTablePageMaxHeightCollection.RemoveAt(System.Int32)
Removes the item at the specified index.
index: The index.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTablePageMaxHeightCollection.Clear
Removes all items from the collection.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTablePageMaxHeightCollection.Remove(System.Double)
Removes the specified item from the collection.
value: The item to remove.