Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableCellFormat
Represents a Schedule table cell format.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableCellFormat.#ctor
Initializes a new instance of the ScheduleTableCellFormat class.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableCellFormat.TextStyleId
Gets the text style id.
Returns: The text style id.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableCellFormat.TextStyleIdString
Gets the text style id string.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableCellFormat.Alignment
Gets or sets the alignment.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableCellFormat.Width
Gets or sets the width.
Returns: The width.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableCellFormat.Height
Gets or sets the height.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableCellFormat.Gap
Gets or sets the gap.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableCellFormat.RotationType
Gets or sets the rotation type.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableCellFormat.MatrixSymbolType
Gets or sets the matrix symbol type.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableCellFormat.UseMatrixForTrueFalse
Gets or sets the use matrix for true false.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableCellFormat.ExtentsWidth(System.String)
Extents width.
string: The string.
Returns: The width.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableCellFormat.ExtentsHeight(System.String)
Extents height.
string: The string.
Returns: The extented height.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableCellFormat.ExtentsCellWidth(System.String)
Extents cell width.
string: The string.
Returns: The extented cell width.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableCellFormat.ExtentsCellHeight(System.String)
Extents cell height.
string: The string.
Returns: The extented cell height.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableCellFormat.CellHeight(System.String,System.Double)
Cell height.
string: The string.
fixedWidth: The fixed width.
Returns: The cell height.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableCellFormat.GetRotatedTextCellWidth(System.String,System.Double)
Gets the rotated text cell width.
string: The string.
fixedWidth: The fixed width.
Returns: The rotated text cell width.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableCellFormat.MatrixExtentsCellWidth(System.Int32)
Matrix extents cell width.
count: The count.
Returns: The matrix extents cell width.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableCellFormat.MatrixExtentsCellHeight(System.Int32)
The matrix extents cell height.
count: The count.
Returns: The matrix extents cell height.