Autodesk.Aec.PropertyData.DatabaseServices.DisplayThemeScheduleDataRuleParameter
DisplayThemeScheduleDataRuleParameter enumeration.

Autodesk.Aec.PropertyData.DatabaseServices.DisplayThemeScheduleDataRuleParameter.PropertySetDefinition
Property set definition.

Autodesk.Aec.PropertyData.DatabaseServices.DisplayThemeScheduleDataRuleParameter.PropertyDefinitionId
Property definition id.