Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinition
Represents a property definition.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinition.#ctor
Initializes a new instance of the PropertyDefinition class.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinition.Name
Gets or sets the name.
Returns: Returns the name.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinition.GlobalName
Gets or sets the global name.
Returns: Returns the global name.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinition.Id
Gets or sets the Id.
Returns: Returns the Id.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinition.DataType
Gets or sets the data type.
Returns: Returns the data type.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinition.ClearAutomaticData
Clears automatic data.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinition.SetAutomaticData(System.String,System.String)
Sets automatic data. If the function name is not found, a KeyNotFound exception is thrown.
className: The object type name. This is a string similar to the AppliesTo values. It is the internal class/type name. For example: AecDbWall.
sourceName: The source name. This is the same name (aka function name) as provided in the ACA UI.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinition.GetAutomaticData
Gets the automatic data.
Returns: Returns the automatic data.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinition.RemoveAutomaticData(System.String)
Removes automatic data based on the class name.
className: The class name to search for.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinition.DefaultData
Gets or sets the default data.
Returns: Returns the default data, or null if not found.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinition.FormatId
Gets or sets the format Id.
Returns: Returns the format Id.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinition.FormatString
Gets the format string.
Returns: Returns the format string.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinition.ExampleString
Gets the example string.
Returns: Returns the example string.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinition.ListDefinitionId
Gets or sets the list definition id.
Returns: Returns the list definition id.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinition.IsAutomatic
Gets the value indicating if the property is automatic.
Returns: Returns the value indicating if the property is automatic.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinition.Automatic
Sets the value indicating if the property is automatic.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinition.DefaultIsUnspecified
Gets or sets the value indicating if the default value is unspecified.
Returns: Returns the value indicating if the default value is unspecified.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinition.IsLocked
Gets or sets whether the property definition is locked.
Returns: Returns whether the property definition is locked.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinition.Value(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
Determines the value of the property.
id: The id of the object.
blockRefPath: The block reference paths Ids.
Returns: Returns the value of the property, or null if not found.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinition.Value(Autodesk.AutoCAD.DatabaseServices.DBObject,Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
Determines the value of the property.
dbObject: The object.
blockRefPath: The block reference paths Ids.
Returns: Returns the value of the property, or null if not found.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinition.GetSampleValue
Gets a sample value.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinition.GetSampleValue(Autodesk.Aec.DatabaseServices.UnitType)
Gets a sample value for the given unit type.
unitType: The unit type.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinition.Synchronize(Autodesk.Aec.PropertyData.DatabaseServices.PropertySet,Autodesk.Aec.PropertyData.DatabaseServices.PropertySetDefinition,Autodesk.AutoCAD.DatabaseServices.DBObject)
Synchronizes the property definition by updating its state.
propertySet: The property set.
definition: The property set definition.
attachedTo: The object attached to.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.
Remarks: The attachedTo parameter is not used.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinition.References(Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Int32,Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Int32)
Determines if this property definition references the specified property definition.
propertySetDefinitionId: The other property set definition.
propertyDefinitionId: The other property definition Id.
propertySetDefinitionId2: This property set definition.
propertyDefinitionId2: This property definition Id.
Returns: Returns true if this property definition references the specified property definition.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinition.ContainsFields
Gets the value that indicates if the property definition contains fields.
Returns: Returns the value that indicates if the property definition contains fields.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinition.ClearFieldData
Clears the field data.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinition.GetFieldGeneratedData(System.Boolean)
Get the field generated data.
asFieldCode: Determines if the value returned is a field code or text.
Returns: Returns the field generated data, or null if not found.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinition.FieldBucketId
Gets the field code Id.
Returns: Returns the field code Id.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinition.UnitType
Gets or sets the unit type.
Returns: Returns the unit type.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.
Remarks: Applies only to manual property definitions with the data type Real.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinition.IsReadOnly
Gets or sets whether the property definition is read-only.
Returns: Returns whether the property definition is read-only.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinition.IsVisible
Gets or sets whether the property definition is visible.
Returns: Returns whether the property definition is visible.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinition.DisplayOrder
Gets the display order of the property definition.
Returns: Returns the display order of the property definition.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinition.GetFieldId
Get the field id.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.