Autodesk.Aec.PropertyData.DatabaseServices.DisplayThemeScheduleDataRule
Represents a display theme schedule data rule.

Autodesk.Aec.PropertyData.DatabaseServices.DisplayThemeScheduleDataRule.#ctor
Initializes a new instance of the DisplayThemeScheduleDataRule class.

Autodesk.Aec.PropertyData.DatabaseServices.DisplayThemeScheduleDataRule.PropertySetDefinitionId
Retrieve the id of the property set definition.
Returns: The id of the property set definition.

Autodesk.Aec.PropertyData.DatabaseServices.DisplayThemeScheduleDataRule.SetPropertySetDefinitionId(Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Boolean)
Set the id of the property set definition.
id: The new id of the property set definition.
isUpdate: Flag that indicates whether it is needed to update.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.DisplayThemeScheduleDataRule.PropertyDefinitionId
Retrieve the id of the property definition.
Returns: The id of the property definition.

Autodesk.Aec.PropertyData.DatabaseServices.DisplayThemeScheduleDataRule.SetPropertyDefinitionId(System.Int32,System.Boolean)
Set the id of the property definition.
id: The new id of the property definition.
isUpdate: Flag that indicates whether it is needed to update.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.DisplayThemeScheduleDataRule.GetValidPropertySetDefinitions(Autodesk.AutoCAD.DatabaseServices.Database,Autodesk.Aec.DatabaseServices.NameObjectIdPairCollection)
Retrieves valid property set difinitions.
db: Database.
validAvailablePropertyDefinitionSets: Name object id pair collection.
Returns: Flag indicates success.