Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleColumn
Represents a Schedule Table Style Column.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleColumn.#ctor
Initializes a new instance of the ScheduleTableStyleColumn class.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleColumn.DefaultData
Gets or sets the default data.
Returns: Returns the default data.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleColumn.Heading
Gets or sets the heading.
Returns: The heading.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleColumn.FormatId
Gets the format id.
Returns: Returns the format id.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleColumn.SetFormatId
Sets the format id.
Returns: The format id.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleColumn.PropertySetDefinitionId
Gets the propertyset definition id.
Returns: Returns the propertyset definition id.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleColumn.PropertySetDefinitionId(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Sets the propertyset definition id.
propertySetDefinitionId: The propertyset definition id.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleColumn.PropertyId
Gets or sets the property id.
Returns: Returns  the property id.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleColumn.Matrix
Gets or sets the schedule table variant matrix.
Returns: Returns the schedule table variant matrix.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleColumn.MaxMatrixCols
Gets the maximum of matrix columns.
Returns: Returns the maximum of matrix columns.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleColumn.MaximumMatrixColumns
Sets the maximum of matrix columns.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleColumn.Total
Gets or sets the total.
Returns: Returns the total.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleColumn.FormulaTotal
Gets or sets the formula total.
Returns: Returns the formula total.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleColumn.ColumnType
Gets or sets the column type.
Returns: Return the column type.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleColumn.CellFormatOverride
Gets or sets the schedule table cell format override.
Returns: Returns the schedule table cell format override.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleColumn.PropertyName
Gets the property name.
Returns: Returns the property name.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleColumn.PropertySetDefinitionName
Gets the property name.
Returns: Returns the property name.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleColumn.FullPropertyName
Gets the property full name.
Returns: Returns the property full name.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleColumn.CheckPropertyValid
Checks if the property is valid.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleColumn.IsPropertyValid
Indicates if the property is valid.
Returns: Returns true if the property is valid, false otherwise.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleColumn.HideColumn
Indicates if the column is hide.
Returns: Return true, if the column is hide, false otherwise.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleColumn.Formula
Gets or sets the property defination formula.
Returns: Returns the property defination formula.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleColumn.Evaluate
Evaluates the formula and return result with Quantity.
Returns: Returns the variant.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleColumn.Evaluate(System.String&amp;,System.Int32)
Evaluates the formula and return result with Quantity.
formula: The formula string.
quantity: The quantity.
Returns: Returns the variant.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.