Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleHeaderTreeNode
Represents a ScheduleTableStyleHeaderTreeNode.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleHeaderTreeNode.#ctor
Initializes a new instance of the ScheduleTableStyleHeaderTreeNode class.