Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinitionAnchor
Represents an anchor property definition.
Remarks: Anchor property definitions allow one object to get data from another object to which it is anchored.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinitionAnchor.#ctor
Initializes a new instance of the PropertyDefinitionAnchor class.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinitionAnchor.PropertySetDefinitionId
Gets or sets the object id of the property set definition to which it references.
Returns: Returns the object id of the property set definition to which it references.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinitionAnchor.PropertyDefinitionId
Gets or sets the id of the property definition inside the property set definition to which it references.
Returns: Returns the id of the property definition inside the property set definition to which it references.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinitionAnchor.UsePropertyDefinitionNamesForDescription
Gets or sets whether the property definition names, to which it references, should be used for description.
Returns: Returns whether the property definition names, to which it references, should be used for description.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinitionAnchor.Valid
Gets whether this property definition is valid.
Returns: Returns whether this property definition is valid.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinitionAnchor.DisplayString
Gets the display string.
Returns: Returns the display string.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinitionAnchor.ExtractAnchoredToObject(Autodesk.Aec.DatabaseServices.Geo)
Extracts the object id of the anchored to object.
geo: The anchored to object.
Returns: The object id of the anchored to object.