Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableColumn
Represents a schedule table column.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableColumn.#ctor
Initializes a new instance of the ScheduleTableColumn class.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableColumn.CellWidth
Gets or sets the cell width.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableColumn.SetFixedCellWidth(System.Double)
Sets the fixed cell width.
cellWidth: The cell width.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableColumn.CellX
Gets or sets the cell x.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableColumn.MatrixValues
Gets or sets the matrix values.