Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableImage
Represents a schedule table image.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableImage.#ctor
Initializes a new instance of the ScheduleTableImage class.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableImage.AddImageDefinition(System.String,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Add image definition.
filename: The file name.
definitionId: The definition id.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableImage.FindImageDefinition(System.String)
Find the image definition.
filename: The file name.
Returns: The image definition id.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableImage.AddImage(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Add image.
imageId: The image id.
Returns: True if found, false otherwise.