Autodesk.Aec.PropertyData.DatabaseServices.DxfData
Defines identifiers that indicate the dxf data type.

Autodesk.Aec.PropertyData.DatabaseServices.DxfData.DxfId
The dxf data id.

Autodesk.Aec.PropertyData.DatabaseServices.DxfData.DxfVariantEmpty
The dxf data is empty.

Autodesk.Aec.PropertyData.DatabaseServices.DxfData.DxfVariantI4
The dxf data is a long.

Autodesk.Aec.PropertyData.DatabaseServices.DxfData.DxfVariantR8
The dxf data is a double.

Autodesk.Aec.PropertyData.DatabaseServices.DxfData.DxfVariantBstr
The dxf data is a string.

Autodesk.Aec.PropertyData.DatabaseServices.DxfData.DxfVariantBool
The dxf data is a boolean.