Autodesk.Aec.PropertyData.DatabaseServices.RoundingType
Defines identifiers that indicate the rounding type.

Autodesk.Aec.PropertyData.DatabaseServices.RoundingType.RoundOff
The rounding type is round off.

Autodesk.Aec.PropertyData.DatabaseServices.RoundingType.RoundUp
The rounding type is round up.

Autodesk.Aec.PropertyData.DatabaseServices.RoundingType.RoundDown
The rounding type is round down.