Autodesk.Aec.PropertyData.DatabaseServices.UnitsType
Defines identifiers that indicate the unit type.

Autodesk.Aec.PropertyData.DatabaseServices.UnitsType.Scientific
The Units type is scientific.

Autodesk.Aec.PropertyData.DatabaseServices.UnitsType.Decimal
The Units type is decimal.

Autodesk.Aec.PropertyData.DatabaseServices.UnitsType.Engineering
The Units type is not engineering.

Autodesk.Aec.PropertyData.DatabaseServices.UnitsType.Architectural
The Units type is architectural.

Autodesk.Aec.PropertyData.DatabaseServices.UnitsType.Fractional
The Units type is fractional.

Autodesk.Aec.PropertyData.DatabaseServices.UnitsType.WindowsDesktop
The Units type is not windows desktop.

Autodesk.Aec.PropertyData.DatabaseServices.UnitsType.Degrees
The Units type is degrees.

Autodesk.Aec.PropertyData.DatabaseServices.UnitsType.DegreesMinutesSeconds
The Units type is degrees minutes seconds.

Autodesk.Aec.PropertyData.DatabaseServices.UnitsType.Gradians
The Units type is not gradians.

Autodesk.Aec.PropertyData.DatabaseServices.UnitsType.Radians
The Units type is radians.

Autodesk.Aec.PropertyData.DatabaseServices.UnitsType.Surveyor
The Units type is surveyor.