Autodesk.Aec.PropertyData.DatabaseServices.DictionaryScheduleTableStyle
Represents a schedule table style dictionary.

Autodesk.Aec.PropertyData.DatabaseServices.DictionaryScheduleTableStyle.#ctor(Autodesk.AutoCAD.DatabaseServices.Database)
Initializes a new instance of the DictionaryScheduleTableStyle class using the specified database.
db: The database.

Autodesk.Aec.PropertyData.DatabaseServices.DictionaryScheduleTableStyle.GetStandardStyle(Autodesk.AutoCAD.DatabaseServices.Database)
Gets the standard table style id.
db: The database.
Returns: The standard table style id.