Autodesk.Aec.PropertyData.ScheduleTableColumnOrder
Represents a schedule table column order.

Autodesk.Aec.PropertyData.ScheduleTableColumnOrder.CompareRows(System.Int32,System.Int32,System.Boolean)
Compares two rows.
row1: The first row.
row2: The second row.
raw: Determines if the row and column are raw value. When row == false, need indirection via our indexing arrays.
Returns: Returns the comparing result.