Autodesk.Aec.PropertyData.DatabaseServices.PageDirectionType
Defines identifiers that indicate the page direction.

Autodesk.Aec.PropertyData.DatabaseServices.PageDirectionType.PageRight
Page right.

Autodesk.Aec.PropertyData.DatabaseServices.PageDirectionType.PageDown
Page down.