Autodesk.Aec.PropertyData.DatabaseServices.PropertySet
Represents a property set.

Autodesk.Aec.PropertyData.DatabaseServices.PropertySet.#ctor
Initializes a new instance of the PropertySet class.

Autodesk.Aec.PropertyData.DatabaseServices.PropertySet.PropertyNameToId(System.String)
Gets the id for the specified property name.
name: The property name.
Returns: Returns the id for the specified property name.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.PropertySet.PropertyIdToName(System.Int32)
Gets the property name for the specified property id.
propertyId: The property id.
Returns: Returns the property name for the specified property id.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.PropertySet.GetAt(System.Int32)
Gets the property data for the specified property id.
propertyId: The property id.
Returns: Returns the property data for the specified property id, or null if not found.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.PropertySet.GetAt(System.Int32,Autodesk.Aec.DatabaseServices.UnitType)
Gets the property data for the specified property id.
propertyId: The property id.
unitType: The unit type.
Returns: Returns the property data for the specified property id, or null if not found.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.PropertySet.GetAt(System.Int32,Autodesk.AutoCAD.DatabaseServices.DBObject)
Gets the property data for the specified property id.
propertyId: The property id.
dbObject: The object.
Returns: Returns the property data for the specified property id, or null if not found.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.PropertySet.GetAt(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection,System.Int32)
Gets the property data indicated by the specified object id, block reference paths, and property id.
id: The object id.
blockRefPath: The collection of block reference paths to uniquely refer to the object.
propertyId: The property id.
Returns: Returns the property data indicated by the specified object id, block reference paths, and property id, or null if not found.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.PropertySet.GetAt(Autodesk.AutoCAD.DatabaseServices.DBObject,Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection,System.Int32)
Gets the property data indicated by the specified object, block reference paths, and property id.
dbObject: The object.
blockRefPath: The collection of block reference paths to uniquely refer to the object.
propertyId: The property id.
Returns: Returns the property data indicated by the specified object, block reference paths, and property id, or null if not found.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.PropertySet.GetAt(Autodesk.AutoCAD.DatabaseServices.DBObject,Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection,System.Int32,Autodesk.Aec.DatabaseServices.UnitType)
Gets the property data indicated by the specified object, block reference paths, property id and unit type.
dbObject: The object.
blockRefPath: The collection of block reference paths to uniquely refer to the object.
propertyId: The property id.
Returns: Returns the property data indicated by the specified object, block reference paths, property id and unit type, or null if not found.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.PropertySet.GetPropertySetDataAt(System.Int32)
Gets the property set data for the specified property.
propertyId: The property id.
Returns: Returns the property set data for the specified property.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.PropertySet.SetAt(System.Int32,System.String)
Sets the property data for the specified property id.
propertyId: The property id.
data: The property data value.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.PropertySet.SetAt(System.Int32,System.Boolean)
Sets the property data for the specified property id.
propertyId: The property id.
data: The property data value.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.PropertySet.SetAt(System.Int32,System.Object)
Sets the property data for the specified property id.
propertyId: The property id.
data: The property data value.
Throws System.ArgumentException: System.ArgumentException.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.PropertySet.SetAt(System.Int32,System.Object,Autodesk.Aec.DatabaseServices.UnitType)
Sets the property data for the specified property id.
propertyId: The property id.
data: The property data value.
unitType: The unit type.
Throws System.ArgumentException: System.ArgumentException.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.PropertySet.SetAt(System.Int32,System.Int32)
Sets the property data for the specified property id.
propertyId: The property id.
data: The property data value.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.PropertySet.SetAt(System.Int32,System.Double)
Sets the property data for the specified property id.
propertyId: The property id.
data: The property data value.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.PropertySet.SetAt(System.Int32,System.Double,Autodesk.Aec.DatabaseServices.UnitType)
Sets the property data for the specified property id.
propertyId: The property id.
data: The property data value.
unitType: The unit type.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.PropertySet.ObjectAttachedTo
Gets or sets the id of the object that the property set is attached to.
Returns: The id of the object that the property set is attached to.

Autodesk.Aec.PropertyData.DatabaseServices.PropertySet.PropertySetDefinition
Gets or sets the property set definition.
Returns: Returns the property set definition.

Autodesk.Aec.PropertyData.DatabaseServices.PropertySet.PropertySetDefinitionName
Gets the property set definition name.
Returns: Returns the property set definition name.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.PropertySet.Synchronize(Autodesk.Aec.PropertyData.DatabaseServices.PropertySetDefinition,Autodesk.AutoCAD.DatabaseServices.DBObject)
Synchronizes the property set by updating its state.
propertySetDefinition: The property set definition.
db: The database.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.PropertySet.GetCurrentAutoIncrementValue(Autodesk.Aec.PropertyData.DatabaseServices.PropertySetDefinition,System.Int32)
Gets the highest value across all property sets that use the specified definition.
propertySetDefinition: The property set definition.
propertyId: The property id.
Returns: Returns the current auto-increment value.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.PropertySet.GetCurrentAlphaIncrementValue(Autodesk.Aec.PropertyData.DatabaseServices.PropertySetDefinition,System.Int32)
Gets the current alpha-increment value.
propertySetDefinition: The property set definition.
propertyId: The property id.
Returns: Returns the current alpha-increment value.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.PropertySet.CompareAlphaIncrementValues(System.String,System.String)
Compares two alpha-increment values.
string1: The first alpha-increment value.
string2: The second alpha-increment value.
Returns: A value representing the result of the comparison.
Remarks: Returns -1 if string1 < string2.  Returns  0 if string1 = string2.  Returns  1 if string1 > string2.

Autodesk.Aec.PropertyData.DatabaseServices.PropertySet.IncrementAlphaValue(System.String)
Increments the specified alphabetical value.
alpha: The alphabetical value.
Returns: The incremented alphabetical value.
Remarks: Assumes that all characters in the string are either upper or lower case.

Autodesk.Aec.PropertyData.DatabaseServices.PropertySet.UpdateAutoIncrementProperties
Updates the auto-increment properties.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.PropertySet.UpdateReferencingAttributes
Updates the referencing attributes.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.PropertySet.PropertySetData
Gets the collection of property set data.
Returns: Returns the collection of property set data.

Autodesk.Aec.PropertyData.DatabaseServices.PropertySet.GetValueAndUnitAt(System.Int32)
Gets the property value and unit type for the specified property id.
propertyId: The property id.
Returns: Returns the property value and unit type for the specified property id, or null if not found.
Throws System.NotSupportedException: System.NotSupportedException.
Throws System.Runtime.InteropServices.InvalidOleVariantTypeException: System.Runtime.InteropServices.InvalidOleVariantTypeException.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.PropertySet.GetValueAndUnitAt(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection,System.Int32)
Gets the property value and unit type for the specified property id.
id: The object id.
blockRefPath: The collection of block reference paths to uniquely refer to the object.
propertyId: The property id.
Returns: Returns the property value and unit type for the specified property id, or null if not found.
Throws System.NotSupportedException: System.NotSupportedException.
Throws System.Runtime.InteropServices.InvalidOleVariantTypeException: System.Runtime.InteropServices.InvalidOleVariantTypeException.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.