Autodesk.Aec.PropertyData.DatabaseServices.CaseType
Defines identifiers that indicate the case type.

Autodesk.Aec.PropertyData.DatabaseServices.CaseType.CaseAsIs
The Case type is as is.

Autodesk.Aec.PropertyData.DatabaseServices.CaseType.CaseUpper
The Case type is upper.

Autodesk.Aec.PropertyData.DatabaseServices.CaseType.CaseLower
The Case type is lower.

Autodesk.Aec.PropertyData.DatabaseServices.CaseType.CaseSentence
The Case type is sentence.

Autodesk.Aec.PropertyData.DatabaseServices.CaseType.CaseTitle
The Case type is title.