Autodesk.Aec.PropertyData.ScheduleTableColumnOrderSingleColumn
Represents schedule table column order single column.

Autodesk.Aec.PropertyData.ScheduleTableColumnOrderSingleColumn.#ctor(Autodesk.Aec.PropertyData.ScheduleTableVariantMatrix,System.Int32,System.Boolean)
Initializes a new instance of the ScheduleTableColumnOrderSingleColumn class using the specified variant matrix and column.
matrix: The variant matrix.
column: The column.
ascending: Indicate the sorting way.