Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinitionProject
Represents a project property definition.
Remarks: Project property values are obtained from the drawing management project in which an object is located.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinitionProject.#ctor
Initializes a new instance of the PropertyDefinitionProject class.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinitionProject.ProjectDataType
Gets or sets the project data type.
Returns: Returns the project data type.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinitionProject.ProjectDetailCategory
Gets or sets the project detail category.
Returns: Returns the project detail category.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinitionProject.ProjectDetailName
Gets or sets the project detail name.
Returns: Returns the project detail name.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinitionProject.UseProjectInfoForDescription
Gets or sets whether the project information should be used for description.
Returns: Returns whether the project information should be used for description.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinitionProject.GetDisplayString(Autodesk.Aec.PropertyData.DatabaseServices.ProjectDataType)
Gets the display string of the specified project data type.
type: The specified project data type.