Autodesk.Aec.PropertyData.DatabaseServices.Precision
Defines identifiers that indicate the precision.

Autodesk.Aec.PropertyData.DatabaseServices.Precision.PrecisionCount
The precision is precision count.

Autodesk.Aec.PropertyData.DatabaseServices.Precision.PrecisionCountForDegreesMinutesSeconds
The precision is precision count for degrees minutes seconds.

Autodesk.Aec.PropertyData.DatabaseServices.Precision.PrecisionCountForSurveyor
The precision is precision count for surveyor.