Autodesk.Aec.PropertyData.DatabaseServices.SortOrder
Defines identifiers that indicate the sort order.

Autodesk.Aec.PropertyData.DatabaseServices.SortOrder.Ascending
Ascending.

Autodesk.Aec.PropertyData.DatabaseServices.SortOrder.Descending
Desending.