Autodesk.Aec.PropertyData.IteratorType
Defines IteratorType for ScheduleTableStyleHeaderTreeIterator.

Autodesk.Aec.PropertyData.IteratorType.DepthFirst
Depth first.

Autodesk.Aec.PropertyData.IteratorType.ParentFirst
Parent first.