Autodesk.Aec.PropertyData.DatabaseServices.PropertyValueUnitPair(System.Object,Autodesk.Aec.DatabaseServices.UnitType).#ctor
Initializes a new instance of the PropertyValueUnitPair class.
value: The value.
type: The unit type.