Autodesk.Aec.PropertyData.DatabaseServices.ForwardedType
Defines identifiers that indicate the forwarded type.

Autodesk.Aec.PropertyData.DatabaseServices.ForwardedType.Same
The forwarded type is the same.

Autodesk.Aec.PropertyData.DatabaseServices.ForwardedType.Local
The forwarded type is local.

Autodesk.Aec.PropertyData.DatabaseServices.ForwardedType.External
The forwarded type is external.