Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleColumnCollection
Represents a collection of ScheduleTableStyleColumn.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleColumnCollection.GetEnumerator
Returns an enumerator for this collection.
Returns: Returns an enumerator for this collection.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleColumnCollection.Count
Returns the number of ScheduleTableStyleColumn available in this collection.
Returns: Returns the number of ScheduleTableStyleColumn available in this collection.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleColumnCollection.CopyTo(Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleColumn[],System.Int32)
Copies the collection to the array.
array: The ScheduleTableStyleColumn array.
index: The start index to begin copying.
Throws System.ArgumentNullException: System.ArgumentNullException.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.
Throws System.ArgumentException: System.ArgumentException.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleColumnCollection.Item(System.Int32)
Gets or sets the item at the given index.
index: The index.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleColumnCollection.Add(Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleColumn)
Adds an item to the collection.
value: The item.
Returns: Returns the index where the item was added.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleColumnCollection.Contains(Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleColumn)
Determines if the collection contains the specified item.
value: The item.
Returns: Returns true if the collection contains the specified item.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleColumnCollection.IndexOf(Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleColumn)
Determines the index of the specified item.
value: The item.
Returns: Returns the index of the specified item.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleColumnCollection.Insert(System.Int32,Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleColumn)
Inserts the specified item into the collection at the specified index.
index: The index to insert the item at.
value: The item to insert.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleColumnCollection.RemoveAt(System.Int32)
Removes the item at the specified index.
index: The index.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleColumnCollection.Clear
Removes all items from the collection.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleColumnCollection.Prepend(Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleColumn)
Prepend a column to the collection.
column: The new column.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleColumnCollection.Remove(Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleColumn)
Removes the specified item from the collection.
value: The item to remove.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleColumnCollection.IndexOf(Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Int32)
Determines the index of the specified item.
propSetDefId: The propSetDefId.
propId: The propId.
Returns: Returns the index of the specified item.