Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinitionLocation
Represents a location property definition.
Remarks: Location property values are obtained from property data on AEC polygons or spaces in or near an object.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinitionLocation.#ctor
Initializes a new instance of the PropertyDefinitionLocation class.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinitionLocation.AppliesTo
Gets or sets the class type to which this location property applies.
Returns: Returns the class type to which this location property applies.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinitionLocation.SetAppliesTo(System.String)
Sets the class type to which this location property applies using the class name.
className: The class name to which this location property applies.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinitionLocation.PropertySetDefinitionId
Gets or sets the object id of the property set definition to which it references.
Returns: Returns the object id of the property set definition to which it references.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinitionLocation.PropertyDefinitionId
Gets or sets the id of the property definition inside the property set definition to which it references.
Returns: Returns the id of the property definition inside the property set definition to which it references.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinitionLocation.UsePropertyDefinitionNamesForDescription
Gets or sets whether the property definition names, to which it references, should be used for description.
Returns: Returns whether the property definition names, to which it references, should be used for description.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinitionLocation.Valid
Gets whether this property definition is valid.
Returns: Returns whether this property definition is valid.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinitionLocation.DisplayString
Gets the display string.
Returns: Returns the display string.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.