Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleHeaderNode
Represents a ScheduleTableStyleHeaderNode.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleHeaderNode.#ctor
Initializes a new instance of the ScheduleTableStyleHeaderNode class.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleHeaderNode.Level
Gets the level property.
Returns: The Level.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleHeaderNode.Children
Gets the child nodes of this node.
Returns: The collection of all child nodes.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleHeaderNode.Parent
Gets the parent node.
Returns: The parent node.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleHeaderNode.SetTreeParent(Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleHeaderNode)
Sets the tree parent.
parent: The parent node.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleHeaderNode.Text
Gets or sets the text value.
Returns: The text value.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleHeaderNode.FormatOverride
Gets or sets the format value.