Autodesk.Aec.PropertyData.DatabaseServices.DictionaryPropertyDataFormat
Represents a property data format dictionary.

Autodesk.Aec.PropertyData.DatabaseServices.DictionaryPropertyDataFormat.#ctor(Autodesk.AutoCAD.DatabaseServices.Database)
Initializes a new instance of the DictionaryPropertyDataFormat class using the specified database.
db: The database.

Autodesk.Aec.PropertyData.DatabaseServices.DictionaryPropertyDataFormat.GetStandardFormat(Autodesk.AutoCAD.DatabaseServices.Database)
Get standard format.
db: The database.