Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleColumnType
Defines the column type.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleColumnType.Normal
Normol column.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleColumnType.Quantity
Quantity column.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleColumnType.Formula
Formula column.