Autodesk.Aec.PropertyData.ScheduleTableStyleHeaderTreeParameter
Defines parameter for ScheduleTableStyleHeaderTree.

Autodesk.Aec.PropertyData.ScheduleTableStyleHeaderTreeParameter.Header
Header.

Autodesk.Aec.PropertyData.ScheduleTableStyleHeaderTreeParameter.Column
Column.