Autodesk.Aec.PropertyData.DatabaseServices.PropertyDataFormat
Represents a ScheduleDataFormat.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDataFormat.#ctor
Initializes a new instance of the PropertyDataFormat class.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDataFormat.Prefix
Gets or sets the prefix.
Returns: The prefix.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDataFormat.Suffix
Gets or sets the suffix.
Returns: The suffix.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDataFormat.Case
Gets or sets the case.
Returns: The case.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDataFormat.Units
Gets or sets the units.
Returns: The units.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDataFormat.Precision
Gets or sets the precision.
Returns: The precision.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDataFormat.Separator
Gets or sets the separator.
Returns: The separator.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDataFormat.Fraction
Gets or sets the fraction.
Returns: The fraction.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDataFormat.LeadingZeros
Gets or sets if it is leading zeros.
Returns: True if it is leading zeros, false otherwise.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDataFormat.TrailingZeros
Gets or sets if it is trailing zeros.
Returns: True if it is trailing zeros, false otherwise.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDataFormat.ZeroFeet
Gets or sets if it is zero feet.
Returns: True if it is zero feet, false otherwise.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDataFormat.ZeroInches
Gets or sets if it is zero Inches.
Returns: True if it is zero Inches, false otherwise.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDataFormat.RoundOff
Gets or sets the round off.
Returns: The round off.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDataFormat.ZeroPadding
Gets or sets the zero padding.
Returns: Zero padding.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDataFormat.TrueText
Gets or sets the true text.
Returns: The true text.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDataFormat.FalseText
Gets or sets the false text.
Returns: The false text.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDataFormat.Undefined
Gets or sets the undefined string.
Returns: The undefined string.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDataFormat.NotApplicable
Gets or sets the not applicable string.
Returns: The not applicable string.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDataFormat.FormatToObject(System.Object)
Format to object.
var: Format.
Returns: Object.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDataFormat.FormatToObject(System.Object,Autodesk.Aec.DatabaseServices.UnitType)
Format to object.
var: Format.
unitType: The unit type.
Returns: Object.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDataFormat.FormatObject(System.Object,System.Boolean)
Format object.
var: Object.
plainText: True if is plain text, false otherwise.
Returns: System.String.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDataFormat.FormaObject(System.Object,Autodesk.Aec.DatabaseServices.UnitType,System.Boolean)
Format object.
var: Object.
unitType: Unit type.
plainText: True if is plain text, false otherwise.
Returns: System.String.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDataFormat.FormaObject(System.Object,Autodesk.AutoCAD.Runtime.ErrorStatus,System.Boolean)
Format object.
var: The object.
es: The error status.
plainText: True if is plain text, false otherwise.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDataFormat.FormaObject(System.Object,Autodesk.Aec.DatabaseServices.UnitType,Autodesk.AutoCAD.Runtime.ErrorStatus,System.Boolean)
Format object.
var: The object.
unitType: The unit type.
es: The error status.
plainText: True if is plain text, false otherwise.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDataFormat.FormaObjectExtend(System.Object,System.Boolean)
Extend format object.
var: Object.
plainText: True if is plain text, false otherwise.
Returns: System.String.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDataFormat.FormaObjectExtend(System.Object,Autodesk.Aec.DatabaseServices.UnitType,System.Boolean)
Extend format object.
var: Object.
unitType: Unit type.
plainText: True if is plain text, false otherwise.
Returns: System.String.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDataFormat.SeparatorComma
Gets or sets separator comma.
Returns: Separator comma.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDataFormat.RoundingMode
Gets or sets rounding mode.
Returns: Rounding mode.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDataFormat.Scale
Gets or sets scale.
Returns: The scale.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDataFormat.UnitType
Gets or sets unit type.
Returns: The unit type.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDataFormat.BuiltinType
Gets or sets built-in type.
Returns: Built-in type.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDataFormat.DoRoundOff(System.Double)
Do round off.
value: ?
Returns: Double.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDataFormat.FormatValues(Autodesk.AutoCAD.Runtime.ErrorStatus,Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Object@,System.Object@)
Formats the specified property value retrieved from the property set based on the specified property data format and the error status returned when the property value was retrieved.
readStatus: The Read status.
idPropertyFormat: The Id property format.
propValue: The property value.
propFormatted: The property formatted.
Returns: True if the formatting was successful; false if values are "*Error getting value*", formatting could not be completed.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDataFormat.FormatValues(Autodesk.AutoCAD.Runtime.ErrorStatus,Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.Aec.DatabaseServices.UnitType,System.Object@,System.Object@)
Formats the specified property value retrieved from the property set based on the specified property data format and the error status returned when the property value was retrieved.
readStatus: The read status.
idPropertyFormat: The Id property format.
unitType: The unit type.
propValue: The property value.
propFormatted: The property formatted.
Returns: True if the formatting was successful; false if values are "*Error getting value*", formatting could not be completed.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDataFormat.ReadErrorValueMessage
Get read error value message.
Returns: Read error value message.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDataFormat.Convert(System.Object,Autodesk.Aec.DatabaseServices.UnitType,Autodesk.Aec.DatabaseServices.UnitType)
Convert from one unit type to another unit type.
data: The variant data.
currentUnitType: The current unit type.
targetUnitType: The target unit type.
Returns: System.Object.