Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinitionClassification
Represents a classification property definition.
Remarks: Including classifications or classification properties in a property set definition for schedules enables you to report classification data for the objects in a schedule table.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinitionClassification.#ctor
Initializes a new instance of the PropertyDefinitionClassification class.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinitionClassification.ClassificationDefinitionId
Gets or sets the object id of the classification definition to which it references.
Returns: Returns the object id of the classification definition to which it references.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinitionClassification.PropertySetDefinitionId
Gets or sets the object id of the property set definition to which it references.
Returns: Returns the object id of the property set definition to which it references.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinitionClassification.PropertyDefinitionId
Gets or sets the id of the property definition inside the property set definition to which it references.
Returns: Returns the id of the property definition inside the property set definition to which it references.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinitionClassification.UseClassificationNamesForDescription
Gets or sets whether the classification definition names, to which it references, should be used for description.
Returns: Returns whether the classification definition names, to which it references, should be used for description.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinitionClassification.Valid
Gets whether this property definition is valid.
Returns: Returns whether this property definition is valid.