Autodesk.Aec.PropertyData.DatabaseServices.FractionType
Defines identifiers that indicate the fraction type.

Autodesk.Aec.PropertyData.DatabaseServices.FractionType.Horizontal
The Fraction type is horizontal.

Autodesk.Aec.PropertyData.DatabaseServices.FractionType.Diagonal
The Fraction type is diagonal.

Autodesk.Aec.PropertyData.DatabaseServices.FractionType.NotStacked
The Fraction type is not stacked.