Autodesk.Aec.PropertyData.DataType
Defines identifiers that indicate the data type.

Autodesk.Aec.PropertyData.DataType.Integer
An integer data type.

Autodesk.Aec.PropertyData.DataType.Real
A real data type.

Autodesk.Aec.PropertyData.DataType.Text
A text data type.

Autodesk.Aec.PropertyData.DataType.TrueFalse
A boolean data type.

Autodesk.Aec.PropertyData.DataType.AutoIncrement
An auto-increment data type.

Autodesk.Aec.PropertyData.DataType.AlphaIncrement
An alpha-increment data type.