Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinitionCollection
Represents a collection of property definitions.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinitionCollection.GetEnumerator
Gets the enumerator for this collection.
Returns: Returns the enumerator for this collection.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinitionCollection.Item(System.Int32)
Gets or sets an item from the collection at the specified index.
index: The index of the item.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinitionCollection.RemoveAt(System.Int32)
Removes an item from the collection at the specified index.
index: The index of the item to remove.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinitionCollection.Clear
Removes all items from the collection.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinitionCollection.Count
Gets the number of items in the collection.
Returns: Returns the number of items in the collection.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinitionCollection.Add(Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinition)
Adds the specified item to the collection.
value: The item to add.
Returns: The number of items in the collection.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinitionCollection.IndexOf(Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinition)
Determines the index of the specified item.
value: The item.
Returns: Returns the index of the specified item.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinitionCollection.IndexOf(System.String)
Determines the index of the property set with the specifed name.
propertyName: The name of the property set.
Returns: Returns the index of the property set with the specifed name.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinitionCollection.Insert(System.Int32,Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinition)
Inserts the specified item into the collection at the specified index.
index: The index to insert the item at.
value: The item to insert.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinitionCollection.Remove(Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinition)
Removes the specified item from the collection.
value: The item to remove.
Throws System.ArgumentException: System.ArgumentException.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinitionCollection.Contains(Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinition)
Determines if the collection contains the specified item.
value: The item.
Returns: Returns true if the collection contains the specified item.

Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinitionCollection.CopyTo(Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinition[],System.Int32)
Copies the collection to the PropertyDefinition array.
array: The PropertyDefinition array.
start: The start index to begin copying.
Throws System.ArgumentNullException: System.ArgumentNullException.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.
Throws System.ArgumentException: System.ArgumentException.