Autodesk.Aec.PropertyData.ScheduleTableUniqueVariantCollection
Represents a collection of Schedule Table Unique Variant.

Autodesk.Aec.PropertyData.ScheduleTableUniqueVariantCollection.#ctor()
Initializes a new instance of the ScheduleTableUniqueVariantCollection class.

Autodesk.Aec.PropertyData.ScheduleTableUniqueVariantCollection.#ctor(System.Boolean)
Initializes a new instance of the ScheduleTableUniqueVariantCollection class.
keepEmpty: If it keep empty.

Autodesk.Aec.PropertyData.ScheduleTableUniqueVariantCollection.#ctor(System.Boolean,System.Int32)
Initializes a new instance of the ScheduleTableUniqueVariantCollection class.
keepEmpty: If it keep empty.
limit: The limit.

Autodesk.Aec.PropertyData.ScheduleTableUniqueVariantCollection.CopyTo(System.Array,System.Int32)
Copy to array.
array: The target array.
start: The start position to copy.

Autodesk.Aec.PropertyData.ScheduleTableUniqueVariantCollection.GetEnumerator
Returns an enumerator for this collection.
Returns: Returns an enumerator for this collection.

Autodesk.Aec.PropertyData.ScheduleTableUniqueVariantCollection.Add(System.Object)
Add value.
value: The value.
Returns: The added index.

Autodesk.Aec.PropertyData.ScheduleTableUniqueVariantCollection.Contains(System.Object)
If contains value.
value: The value.
Returns: True if contains value, false other wise.

Autodesk.Aec.PropertyData.ScheduleTableUniqueVariantCollection.Count
Gets the count.
Returns: The count.

Autodesk.Aec.PropertyData.ScheduleTableUniqueVariantCollection.Item
Returns the item at the given index.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.

Autodesk.Aec.PropertyData.ScheduleTableUniqueVariantCollection.IndexOf(System.Object)
Determines the index of the specified item.
value: The item.
Returns: Returns the index of the specified item.

Autodesk.Aec.PropertyData.ScheduleTableUniqueVariantCollection.IsSynchronized
Is synchronized.
Returns: If it is synchronized.

Autodesk.Aec.PropertyData.ScheduleTableUniqueVariantCollection.IsFixedSize
If it is fixed size.
Returns: If it is fixed size.

Autodesk.Aec.PropertyData.ScheduleTableUniqueVariantCollection.IsReadOnly
Gets if it is readonly.
Returns: If it is readonly.

Autodesk.Aec.PropertyData.ScheduleTableUniqueVariantCollection.SplitDelimitedValues
Gets if split delimited values.
Returns: True if it split delimited values, false otherwise.

Autodesk.Aec.PropertyData.ScheduleTableUniqueVariantCollection.Dump
Dump.