Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTable
Represents a schedule table.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTable.#ctor
Initializes a new instance of the ScheduleTable class.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTable.Title
The title.
Returns: The title.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTable.LayerWildcard
Gets or sets the layer wild card.
Returns: The layer wild card.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTable.SelectionSet
Gets the seletion set.
Returns: The selection set.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTable.SetSelectionSet(Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection,Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
Set the selection set.
entityIds: The entity object idcollection.
entityFiltered: The entity filted.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTable.AddToSelectionSet(Autodesk.AutoCAD.DatabaseServices.Entity)
Add entity to section set.
entity: The entity.
Returns: True if success, false if it is rejected.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTable.AddToSelectionSet(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Add entity id to selection set.
entityId: The entity id.
Returns: If it is filted.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTable.AddToSelectionSet(Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
Add entity id collection to selection set.
entityIds: The entity id collection.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTable.RemoveFromSelectionSet(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Remove from selection Set.
entityId: The entity id.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTable.AddNewEntriesAutomatically
If add new entities automatically.
Returns: True if success, false otherwise.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTable.ScanBlockReferences
Gets or sets if scan block references.
Returns: True if scan block references, false otherwise.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTable.ScanExternalReferences
Gets or sets if scan external references.
Returns: True if scan external references, false otherwise.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTable.AutomaticUpdate
Gets or sets automatic update.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTable.IsOutOfDate
Gets if it is out of data.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTable.Scale
Scale.
Returns: Scale.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTable.XFormMatrix
Gets the xform matrix.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTable.RegenerateTable(System.Boolean)
Regenerate table.
forceUpdate: Force update.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTable.RegenerateSampleTable(System.Boolean)
Regenerate sample table.
forceUpdate: Force update.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTable.ColumnCount
Gets the column count.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTable.RowCount
Gets the row count.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTable.TotalRow
Total row.
Returns: Total row.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTable.ObjectsAtRow(System.Int32)
Objects at row.
row: The row.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTable.CellText(System.Int32,System.Int32)
Cell text.
row: Row.
column: Column.
Returns: Cell text.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTable.CellData(System.Int32,System.Int32)
Cell data.
row: Row.
column: Column.
Returns: The cell data.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTable.SetCellData(System.Int32,System.Int32,System.Object)
Set cell data.
row: Row.
column: Column.
cvar: Cvar.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTable.MatrixHeaderHeight
Get matrix header height.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTable.HeaderHeight
Gets header height.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTable.RowHeight(System.Int32)
Row height.
row: The row.
Returns: The row height.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTable.RowHeightSum(System.Int32)
Row height sum.
row: The row.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTable.TotalRowHeight
Gets total row height.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTable.UpperLeftPoint
Gets upper left point.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTable.LowerLeftPoint
Gets lower left point.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTable.UpperRightPoint
Gets the upper right point.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTable.LowerRightPoint
Gets the lower right point.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTable.CenterPoint
Get the center point.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTable.TableWidth
Gets the table width.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTable.TableHeight
Gets the table height.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTable.TitleHeight
Gets the title height.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTable.TitleIsHorizontal
Gets the title is horizontal.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTable.TitleWidth
Gets the title width.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTable.TitleHeightOffset
Gets the title height offset.
Returns: The title height offset.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTable.TitleWidthOffset
Gets the title width offset.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTable.GetMarker(System.Int32,System.Int32)
Get marker.
row: The row.
column: The column.
Returns: The marker.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTable.GetRow(System.IntPtr)
Get row.
pickedMarker: Picked marker.
Returns: The row.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTable.GetColumn(System.IntPtr)
Get column.
pickedMarker: The picked marker.
Returns: Get column.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTable.GetRowMarkers(System.Int32)
Gets row markers.
row: The row.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTable.GetColumnMatrix(System.Int32)
Gets column matrix.
index: The index.
Returns: The column matrix.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTable.GetHeaderPosition(Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleHeaderNode)
Gets header position.
node: The node.
Returns: The header position.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTable.GetHeaderPositionIterator
Gets the header position iterator.
Returns: The header position.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTable.PageDirection
Gets or sets page direction.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTable.PageSpacing
Gets or sets the page spacing.
Returns: The page spacing.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTable.RepeatTitle
Gets or sets repeat title.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTable.RepeatHeaders
Gets or sets repeat headers.
Returns: Repeat headers.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTable.UseManualHeights
Gets or sets use manual heights.
Returns: Use manual heights.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTable.PageMaxHeight
Gets or sets the page max height.
Returns: The page max height.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTable.GetPageBreaks
Gets page breaks.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTable.GetPageWidths
Gets the page widths.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTable.GetPageHeights
Gets page heights.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTable.BasePageWidth
Gets the base page width.
Returns: The base page width.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTable.MinimumRowHeight
Gets the minimum row height.
Returns: The minimum row height.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTable.ScheduleDrawing
Gets or sets the schedule drawing.
Returns: The schedule drawing.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTable.GetScheduleDrawingName
Gets the schedule drawing name.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTable.GetScheduleDrawingName(System.Boolean)
Gets schedule drawing name.
fullPathIfRelative: Full path if relative.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTable.SetScheduleDrawingName(System.String)
Sets the schedule drawing name.
scheduleDrawingName: The schedule drawing name.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTable.EvaluateFieldCodes
Evaluate field codes.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTable.ForceUseCachedData(System.Boolean)
Force use cached data.
forceUseCache: If force use cache.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTable.GetRasterImageId(System.Object)
Gets raster image id.
varValue: The variant value.
Returns: The raster image id.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTable.IsModelGeometry
Gets is model geometry.
Returns: True if it is model geometry, false otherwise.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTable.PageMaxHeights
Gets page max heights.
Returns: The page max heights.