Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableSortingCollection
Represents a collection of Schedule Table Page Max Height.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableSortingCollection.GetEnumerator
Returns an enumerator for this collection.
Returns: Returns an enumerator for this collection.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableSortingCollection.Count
Returns the number of ScheduleTableSorting^ available in this collection.
Returns: Returns the number of ScheduleTableSorting^ available in this collection.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableSortingCollection.CopyTo(Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableSorting[],System.Int32)
Copies the collection to the array.
array: The ScheduleTableSorting^ array.
start: The start index to begin copying.
Throws System.ArgumentNullException: System.ArgumentNullException.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.
Throws System.ArgumentException: System.ArgumentException.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableSortingCollection.Item(System.Int32)
Returns the item at the given index.
index: The index.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableSortingCollection.Add(Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableSorting)
Adds an item to the collection.
value: The item.
Returns: Returns the index where the item was added.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableSortingCollection.Contains(Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableSorting)
Determines if the collection contains the specified item.
value: The item.
Returns: Returns true if the collection contains the specified item.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableSortingCollection.IndexOf(Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableSorting)
Determines the index of the specified item.
value: The item.
Returns: Returns the index of the specified item.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableSortingCollection.Insert(System.Int32,Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableSorting)
Inserts the specified item into the collection at the specified index.
index: The index to insert the item at.
value: The item to insert.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableSortingCollection.RemoveAt(System.Int32)
Removes the item at the specified index.
index: The index.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableSortingCollection.Clear
Removes all items from the collection.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableSortingCollection.Swap(System.Int32,System.Int32)
Swap two items.
index1: The first item index.
index2: The second item index.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableSortingCollection.#ctor(Autodesk.Aec.PropertyData.DatabaseServices.IScheduleTableSortingOperation)
Constructor.