Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableSorting
Represents a schedule table sorting.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableSorting.#ctor
Initializes a new instance of the ScheduleTableSorting class.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableSorting.GetColumnPropertySetDefinitionObjectId
The column object id.
Returns: The column object id.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableSorting.GetColumnPropertyId
Gets the column property id.
Returns: The column property id.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableSorting.SetColumn(Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Int32,System.Boolean)
Sets the column.
propertySetDefinitionId: The property set definition id.
propertyId: The property id.
isFormulaColumn: Is formula column.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableSorting.SortOrder
Gets or sets the sort order.
Returns: The sort order.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableSorting.UseGroupHeader
Gets or sets the use group header.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableSorting.GroupHeader
Gets or sets the group header.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableSorting.UseSubTotalHeader
Gets or sets if use sub total header.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableSorting.SubTotalHeader
Gets or sets the sub total header.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableSorting.FormulaColumn
Gets or sets formula column.