Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleHeaderTreeIterator
Represents a ScheduleTableStyleHeaderTreeIterator.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleHeaderTreeIterator.#ctor(Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleHeaderTree,Autodesk.Aec.PropertyData.IteratorType)
Initializes a new instance of the ScheduleTableStyleHeaderTreeIterator class.
tree: The tree to be traversed.
type: The type of the iterator.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleHeaderTreeIterator.Next
Gets the next node in the tree.
Returns: The next node.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleHeaderTreeIterator.Reset
Reset the iterator. Note that this operation DOES NOT reload the tree. If your tree is modified, then you're in trouble.

Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleHeaderTreeIterator.Dump
Debug function.