Autodesk.Aec.PropertyData.DatabaseServices.AnchorExtendedTagToEntity
Represents a AnchorExtendedTagToEntity.

Autodesk.Aec.PropertyData.DatabaseServices.AnchorExtendedTagToEntity.#ctor
Initializes a new instance of the AnchorExtendedTagToEntity class.

Autodesk.Aec.PropertyData.DatabaseServices.AnchorExtendedTagToEntity.ReferencedEntityId
Gets or sets the referenced entity id.
Returns: The referenced entity id.

Autodesk.Aec.PropertyData.DatabaseServices.AnchorExtendedTagToEntity.SetReferencedEntityId(Autodesk.Aec.DatabaseServices.Geo)
Set referenced entity id.
geo: The geo.

Autodesk.Aec.PropertyData.DatabaseServices.AnchorExtendedTagToEntity.SetReferencedEntityOldEcs(Autodesk.AutoCAD.Geometry.Matrix3d)
Sets referenced entity old ecs.
mat: The matrix.

Autodesk.Aec.PropertyData.DatabaseServices.AnchorExtendedTagToEntity.ForceHorizontal
Gets or sets the force horizontal.

Autodesk.Aec.PropertyData.DatabaseServices.AnchorExtendedTagToEntity.AllowIndependentUpdate
Gets or sets allow independent update.