Autodesk.Aec.PropertyData.DatabaseServices.PropertySetDataCollection
Represents a collection of property set data.

Autodesk.Aec.PropertyData.DatabaseServices.PropertySetDataCollection.GetEnumerator
Gets the enumerator for this collection.
Returns: Returns the enumerator for this collection.

Autodesk.Aec.PropertyData.DatabaseServices.PropertySetDataCollection.Item(System.Int32)
Gets or sets an item from the collection at the specified index.
index: The index of the item.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.

Autodesk.Aec.PropertyData.DatabaseServices.PropertySetDataCollection.RemoveAt(System.Int32)
Removes an item from the collection at the specified index.
index: The index of the item to remove.
Throws System.NotSupportedException: System.NotSupportedException.
Remarks: Not implemented - read only collection.

Autodesk.Aec.PropertyData.DatabaseServices.PropertySetDataCollection.Clear
Removes all items from the collection.
Throws System.NotSupportedException: System.NotSupportedException.
Remarks: Not implemented - read only collection.

Autodesk.Aec.PropertyData.DatabaseServices.PropertySetDataCollection.Count
Gets the number of items in the collection.
Returns: Returns the number of items in the collection.

Autodesk.Aec.PropertyData.DatabaseServices.PropertySetDataCollection.Add(Autodesk.Aec.PropertyData.DatabaseServices.PropertySetData)
Adds the specified item to the collection.
value: The item to add.
Returns: The number of items in the collection.
Throws System.NotSupportedException: System.NotSupportedException.
Remarks: Not implemented - read only collection.

Autodesk.Aec.PropertyData.DatabaseServices.PropertySetDataCollection.IndexOf(Autodesk.Aec.PropertyData.DatabaseServices.PropertySetData)
Determines the index of the specified item.
value: The item.
Returns: Returns the index of the specified item.

Autodesk.Aec.PropertyData.DatabaseServices.PropertySetDataCollection.Insert(System.Int32,Autodesk.Aec.PropertyData.DatabaseServices.PropertySetData)
Inserts the specified item into the collection at the specified index.
index: The index to insert the item at.
value: The item to insert.
Throws System.NotSupportedException: System.NotSupportedException.
Remarks: Not implemented - read only collection.

Autodesk.Aec.PropertyData.DatabaseServices.PropertySetDataCollection.Remove(Autodesk.Aec.PropertyData.DatabaseServices.PropertySetData)
Removes the specified item from the collection.
value: The item to remove.
Throws System.NotSupportedException: System.NotSupportedException.
Remarks: Not implemented - read only collection.

Autodesk.Aec.PropertyData.DatabaseServices.PropertySetDataCollection.Contains(Autodesk.Aec.PropertyData.DatabaseServices.PropertySetData)
Determines if the collection contains the specified item.
value: The item.
Returns: Returns true if the collection contains the specified item.

Autodesk.Aec.PropertyData.DatabaseServices.PropertySetDataCollection.CopyTo(Autodesk.Aec.PropertyData.DatabaseServices.PropertySetData[],System.Int32)
Copies the collection to the PropertySetData array.
array: The PropertySetData array.
start: The start index to begin copying.
Throws System.ArgumentNullException: System.ArgumentNullException.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.
Throws System.ArgumentException: System.ArgumentException.