Autodesk.Aec.PropertyData.DatabaseServices.RotationType
Defines identifiers that indicate the Rotation Type.

Autodesk.Aec.PropertyData.DatabaseServices.RotationType.Horizontal
Horizontal.

Autodesk.Aec.PropertyData.DatabaseServices.RotationType.Vertical
Vertical.