Autodesk.Aec.PropertyData.DatabaseServices.GraphicType
Defines identifiers that indicate the graphic type.

Autodesk.Aec.PropertyData.DatabaseServices.GraphicType.Block
A block graphic type.

Autodesk.Aec.PropertyData.DatabaseServices.GraphicType.Image
An image graphic type.

Autodesk.Aec.PropertyData.DatabaseServices.GraphicType.Object
An object graphic type.