Autodesk.Aec.PropertyData.DatabaseServices.SeparatorType
Defines identifiers that indicate the separator type.

Autodesk.Aec.PropertyData.DatabaseServices.SeparatorType.Period
The separator type is period.

Autodesk.Aec.PropertyData.DatabaseServices.SeparatorType.Comma
The separator type is comma.

Autodesk.Aec.PropertyData.DatabaseServices.SeparatorType.Space
The separator type is space.

Autodesk.Aec.PropertyData.DatabaseServices.SeparatorType.None
The separator type is none.