Autodesk.Aec.PropertyData.DatabaseServices.DictionaryPropertySetDefinitions
Represents a property set definition dictionary.

Autodesk.Aec.PropertyData.DatabaseServices.DictionaryPropertySetDefinitions.#ctor(Autodesk.AutoCAD.DatabaseServices.Database)
Initializes a new instance of the DictionaryPropertySetDefinitions class using the specified database.
db: The database.