Autodesk.Aec.PropertyData.ScheduleTableColumnOrderAllColumns
Represents  schedule table column order all columns.

Autodesk.Aec.PropertyData.ScheduleTableColumnOrderAllColumns.#ctor(Autodesk.Aec.PropertyData.ScheduleTableVariantMatrix,System.Boolean)
Initializes a new instance of the ScheduleTableColumnOrderAllColumns class using the specified variant matrix.
matrix: The variant matrix.
ascending: Indicates if sort columns by ascending.