Autodesk.Aec.PropertyData.DatabaseServices.PropertySetDefinition
Represents a property set definition.

Autodesk.Aec.PropertyData.DatabaseServices.PropertySetDefinition.#ctor
Initializes a new instance of the PropertySetDefinition class.

Autodesk.Aec.PropertyData.DatabaseServices.PropertySetDefinition.GetValue(System.Int32,Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
Gets the value of the specified property.
propertyId: The property id.
id: The object id.
blockRefPath: The block reference paths.
Returns: Returns the value of the specified property, or null if not found.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.PropertySetDefinition.GetValue(System.Int32,Autodesk.AutoCAD.DatabaseServices.DBObject,Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
Gets the value of the specified property.
propId: The property id.
obj: The object.
blockRefPath: The block reference paths.
Returns: Returns the value of the specified property, or null if not found.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.PropertySetDefinition.AppliesToFilter
Gets the object (or style) names that the set applies to.
Returns: Returns the object (or style) names that the set applies to.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.PropertySetDefinition.SetAppliesToFilter(System.Collections.Specialized.StringCollection,System.Boolean)
Sets the object (or style) names that the set applies to.
filter: The object (or style) names.
byStyle: Determines if the filter is style or object based.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.PropertyData.DatabaseServices.PropertySetDefinition.AppliesToAll
Gets or sets whether the definition applies to all.
Returns: Returns whether the definition applies to all.

Autodesk.Aec.PropertyData.DatabaseServices.PropertySetDefinition.ClassificationFilter
Gets the classification filter collection. Perform add/remove operations on the collection.
Returns: Returns the classification collection.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.
Remarks: When there are no classifications present, an empty collection is provided that classification definition Ids can be added to.

Autodesk.Aec.PropertyData.DatabaseServices.PropertySetDefinition.IsVisible
Gets or sets the value that determines if the definition is visible.
Returns: Returns the value that determines if the definition is visible.

Autodesk.Aec.PropertyData.DatabaseServices.PropertySetDefinition.IsWriteable
Gets or sets the value that determines if the definition is writable.
Returns: Returns the value that determines if the definition is writable.

Autodesk.Aec.PropertyData.DatabaseServices.PropertySetDefinition.RecordAsModified
Triggers a message by checking if the object was opened for write.

Autodesk.Aec.PropertyData.DatabaseServices.PropertySetDefinition.IsStyleBased
Gets the value that indicates that the definition is style based.
Returns: Returns true if the definition is style based.

Autodesk.Aec.PropertyData.DatabaseServices.PropertySetDefinition.IsEquivalent(Autodesk.Aec.PropertyData.DatabaseServices.PropertySetDefinition)
Determines if the definition is equivalvent to the specified definition.
otherDef: The other definition.
Returns: Returns true if the definition is equivalvent to the specified definition.

Autodesk.Aec.PropertyData.DatabaseServices.PropertySetDefinition.Definitions
Gets the collection of property definitions.
Returns: Returns the collection of property definitions.

Autodesk.Aec.PropertyData.DatabaseServices.PropertySetDefinition.SetDisplayOrder(Autodesk.Aec.PropertyData.DatabaseServices.PropertySetDefinition)
Sets the display order of the specified definition.
propertyDef: The property definition.
order: The new display order.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.